Tekla Open API Reference for Tekla Structures 2025
FinishItem Structure
 The FinishItem struct contains information about the finish parameters.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public struct FinishItem
<SerializableAttribute>
Public Structure FinishItem
The FinishItem type exposes the following members.
Constructors
Name | Description
FinishItem
 Creates a new finish item instance.
Top
Properties
Name | Description
Abbreviation
 The finish abbreviation
Description
 The finish description
Top
Methods
Name | Description
ToString
Returns the fully qualified type name of this instance.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace